cpp/samples/security/secpolicy/scenario9/tcpmon-trace9.txt


==============
Listen Port: 9090
Target Host: 127.0.0.1
Target Port: 8080
==== Request ====
POST /axis2/services/sec_echo/echoString HTTP/1.1
User-Agent: Axis2/C
Content-Length: 5881
Content-Type: application/soap+xml;charset=UTF-8
Host: 127.0.0.1:9090

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:To wsu:Id="SigID-733f72c0-980d-1dc1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">http://localhost:9090/axis2/services/sec_echo/echoString</wsa:To>
      <wsa:Action wsu:Id="SigID-733f745a-980d-1dc1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">http://example.com/ws/2004/09/policy/Test/EchoRequest</wsa:Action>
      <wsa:MessageID wsu:Id="SigID-733f74e6-980d-1dc1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">733f4b06-980d-1dc1-27fb-0013ce8f2fc7</wsa:MessageID>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsu:Timestamp wsu:Id="SigID-733f75ea-980d-1dc1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsu:Created>2007-11-21T08:40:44.980Z</wsu:Created>
            <wsu:Expires>2007-11-21T08:46:44.980Z</wsu:Expires>
         </wsu:Timestamp>
         <wsse:UsernameToken wsu:Id="SigID-733f7662-980d-1dc1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:Username>Alice</wsse:Username>
            <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">eezg/4tMxIXfnhZSAcZH5LxAsF8=</wsse:Password>
            <wsse:Nonce>FrTfS3PG+OYZ9T1fMQjiBw0A6mI2y4un</wsse:Nonce>
            <wsu:Created>2007-11-21T08:40:44.980Z</wsu:Created>
         </wsse:UsernameToken>
         <xenc:EncryptedKey Id="EncKeyID-733ff3e4-980d-1dc1" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
            <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/>
            <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
               <wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                  <wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#ThumbprintSHA1">NQM0IBvuplAtETQvk+6gn8C13wE=</wsse:KeyIdentifier>
               </wsse:SecurityTokenReference>
            </ds:KeyInfo>
            <xenc:CipherData>
               <xenc:CipherValue>aYBZb/w+IIWDtWvJUh9AxT4OrQdQ9o6ZvByMmM+g9cjy0gVo6mAGbZt9Hw6GmTjxJO7KdW4EyZngoVCfoHfX47BnoVdDuhhiy5GIDWnStxBTPuMOvXOlhQBkrhn7vLg7CPKvg90AXF2+CQAwNJ/n9q1Z2dbnU0s8iM0L2sSJG84=</xenc:CipherValue>
            </xenc:CipherData>
         </xenc:EncryptedKey>
         <wsc:DerivedKeyToken wsu:Id="DKID-733f7ba8-980d-1dc1" xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
               <wsse:Reference URI="#EncKeyID-733ff3e4-980d-1dc1" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"/>
            </wsse:SecurityTokenReference>
            <wsc:Offset>0</wsc:Offset>
            <wsc:Length>32</wsc:Length>
            <wsc:Nonce>OaLLJCBxErVG1Ydw7/6DRw==</wsc:Nonce>
         </wsc:DerivedKeyToken>
         <xenc:ReferenceList xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"/>
         <ds:Signature Id="SigID-733f7c84-980d-1dc1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
            <ds:SignedInfo>
               <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
               <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/>
               <ds:Reference URI="#SigID-733f72c0-980d-1dc1">
                  <ds:Transforms>
                     <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                  </ds:Transforms>
                  <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                  <ds:DigestValue>AIrCyycuX7MB7mpXNzlQAjz3c7Q=</ds:DigestValue>
               </ds:Reference>
               <ds:Reference URI="#SigID-733f745a-980d-1dc1">
                  <ds:Transforms>
                     <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                  </ds:Transforms>
                  <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                  <ds:DigestValue>5Oow0QQ4Wt8b3Y3MySuCZR9PzCo=</ds:DigestValue>
               </ds:Reference>
               <ds:Reference URI="#SigID-733f74e6-980d-1dc1">
                  <ds:Transforms>
                     <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                  </ds:Transforms>
                  <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                  <ds:DigestValue>dMbHsxfv4m1PoOVT7nvo5+B1XQk=</ds:DigestValue>
               </ds:Reference>
               <ds:Reference URI="#SigID-733f7572-980d-1dc1">
                  <ds:Transforms>
                     <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                  </ds:Transforms>
                  <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                  <ds:DigestValue>iuvW8Z3CFOdRxCIfDo6c+9w4naM=</ds:DigestValue>
               </ds:Reference>
               <ds:Reference URI="#SigID-733f75ea-980d-1dc1">
                  <ds:Transforms>
                     <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                  </ds:Transforms>
                  <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                  <ds:DigestValue>s+6cL8yz6v1B5QyWn3h7yrZHHPo=</ds:DigestValue>
               </ds:Reference>
               <ds:Reference URI="#SigID-733f7662-980d-1dc1">
                  <ds:Transforms>
                     <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                  </ds:Transforms>
                  <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                  <ds:DigestValue>CwHpj2OHt5sSAecalVwVFHsZE3I=</ds:DigestValue>
               </ds:Reference>
            </ds:SignedInfo>
            <ds:SignatureValue>Mb8/Q6rO0GxYDbtmf2d9zX8iVUA=</ds:SignatureValue>
            <ds:KeyInfo>
               <wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                  <wsse:Reference URI="#DKID-733f7ba8-980d-1dc1"/>
               </wsse:SecurityTokenReference>
            </ds:KeyInfo>
         </ds:Signature>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body wsu:Id="SigID-733f7572-980d-1dc1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ns1:echoIn xmlns:ns1="http://ws.apache.org/rampart/c/samples">
         <text>Hello</text>
      </ns1:echoIn>
   </soapenv:Body></soapenv:Envelope>==== Response ====
HTTP/1.1 200 OK
Content-Type: application/soap+xml;charset=UTF-8
Content-Length: 4051

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
   <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
      <wsa:Action>http://example.com/ws/2004/09/policy/Test/EchoRequest</wsa:Action>
      <wsa:From>
         <wsa:Address>http://localhost:9090/axis2/services/sec_echo/echoString</wsa:Address>
      </wsa:From>
      <wsa:MessageID>734d10ba-980d-1dc1-3ebf-0013ce8f2fc7</wsa:MessageID>
      <wsa:RelatesTo wsa:RelationshipType="http://www.w3.org/2005/08/addressing/reply">733f4b06-980d-1dc1-27fb-0013ce8f2fc7</wsa:RelatesTo>
      <wsse:Security soapenv:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <wsu:Timestamp wsu:Id="SigID-734d30f4-980d-1dc1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsu:Created>2007-11-21T08:40:45.071Z</wsu:Created>
            <wsu:Expires>2007-11-21T08:46:45.071Z</wsu:Expires>
         </wsu:Timestamp>
         <xenc:EncryptedKey Id="EncKeyID-734d807c-980d-1dc1" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
            <xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p"/>
            <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
               <wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                  <wsse:KeyIdentifier EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#ThumbprintSHA1">bg6I8267h0TUcPYvYE0D6k6+UJQ=</wsse:KeyIdentifier>
               </wsse:SecurityTokenReference>
            </ds:KeyInfo>
            <xenc:CipherData>
               <xenc:CipherValue>b2I5pzNQTJ/pDHXySSycL3h0sHFll1AU5DWQyIuL8B5g92HNbCOES+T+nIKyG5RPn0Htntk/PqMeWtxaTC//NRkGqKOEadU56Q00Awp8+P2hjjn8UY0aIB8x0Es1sjgNM4bQ899/kSf3ODhNncLCLii8kzpKanhX0di/K1foOEo=</xenc:CipherValue>
            </xenc:CipherData>
         </xenc:EncryptedKey>
         <wsc:DerivedKeyToken wsu:Id="DKID-734d3414-980d-1dc1" xmlns:wsc="http://schemas.xmlsoap.org/ws/2005/02/sc" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
               <wsse:Reference URI="#EncKeyID-734d807c-980d-1dc1" ValueType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey"/>
            </wsse:SecurityTokenReference>
            <wsc:Offset>0</wsc:Offset>
            <wsc:Length>32</wsc:Length>
            <wsc:Nonce>Uu/imeYvlL5wpp0GrhJJZg==</wsc:Nonce>
         </wsc:DerivedKeyToken>
         <xenc:ReferenceList xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"/>
         <ds:Signature Id="SigID-734d34b4-980d-1dc1" xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
            <ds:SignedInfo>
               <ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
               <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1"/>
               <ds:Reference URI="#SigID-734d2fe6-980d-1dc1">
                  <ds:Transforms>
                     <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                  </ds:Transforms>
                  <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                  <ds:DigestValue>SZSp0Q8GgOkeu/+rc1R9tB13ehE=</ds:DigestValue>
               </ds:Reference>
               <ds:Reference URI="#SigID-734d30f4-980d-1dc1">
                  <ds:Transforms>
                     <ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                  </ds:Transforms>
                  <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                  <ds:DigestValue>r8yhUGoyEFEsOeZE09qO4yEFPLE=</ds:DigestValue>
               </ds:Reference>
            </ds:SignedInfo>
            <ds:SignatureValue>dL5qg3xPzlHYmASkOs+kO+Wx/JI=</ds:SignatureValue>
            <ds:KeyInfo>
               <wsse:SecurityTokenReference xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                  <wsse:Reference URI="#DKID-734d3414-980d-1dc1"/>
               </wsse:SecurityTokenReference>
            </ds:KeyInfo>
         </ds:Signature>
      </wsse:Security>
   </soapenv:Header>
   <soapenv:Body wsu:Id="SigID-734d2fe6-980d-1dc1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
      <ns1:RecievedNode xmlns:ns1="http://ws.apache.org/axis2/rampart/samples">
         <LocalName>echoIn</LocalName>
      </ns1:RecievedNode>
   </soapenv:Body></soapenv:Envelope>

==============
